huaweiwx/sduino/sduino/hardware/sduino/stm8/boards.txt
stm8s105k.menu.subboard.S005K6=S005K6(LED:PE5))
stm8s105k.menu.subboard.S005K6.build.series=-DSTM8S005K6 -DSTM8S
stm8s105k.menu.subboard.S005K6.build.mcu=STM8S005
stm8s105k.menu.subboard.S005K6.build.board=S005K6
stm8s105k.menu.subboard.S005K6.build.variant=stm8s105k
stm8s105k.menu.subboard.S005K6.upload.mcu=stm8s005?6

stm8s105k.menu.clock_source.hsi=HSI(16M)
stm8s105k.menu.clock_source.hsi.build.osc=-DHSI=16
stm8s105k.menu.clock_source.hse16=HSE(16M)
stm8s105k.menu.clock_source.hse16.build.osc=-DHSE=16 -DHSE_VALUE=((uint32_t)16000000)
stm8s105k.menu.clock_source.hse8=HSE(8M)
stm8s105k.menu.clock_source.hse8.build.osc=-DHSE=8 -DHSE_VALUE=((uint32_t)8000000)

stm8s105k.menu.cpu_speed.s16=16M
stm8s105k.menu.cpu_speed.s16.build.f_cpu=16000000L {build.osc}
stm8s105k.menu.cpu_speed.s08=8M
stm8s105k.menu.cpu_speed.s08.build.f_cpu=8000000L {build.osc}
stm8s105k.menu.cpu_speed.s04=4M
stm8s105k.menu.cpu_speed.s04.build.f_cpu=4000000L {build.osc}
stm8s105k.menu.cpu_speed.s02=2M
stm8s105k.menu.cpu_speed.s02.build.f_cpu=2000000L {build.osc}
stm8s105k.menu.cpu_speed.s01=1M
stm8s105k.menu.cpu_speed.s01.build.f_cpu=1000000L {build.osc}
stm8s105k.menu.cpu_speed.lsi=LSI_128K
stm8s105k.menu.cpu_speed.lsi.build.f_cpu=128000L -DLSI=128

stm8s105k.menu.jtag_swd.default=General_IO
stm8s105k.menu.jtag_swd.default.build.extra_flags={build.series}
stm8s105k.menu.jtag_swd.swim=Swim
stm8s105k.menu.jtag_swd.swim.build.extra_flags={build.series} -DENABLE_SWIM

stm8s105k.menu.log.default=Release

stm8s105k.menu.log.fatal=FATAL
stm8s105k.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
stm8s105k.menu.log.error=ERROR
stm8s105k.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
stm8s105k.menu.log.warning=WARNING
stm8s105k.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
stm8s105k.menu.log.info=INFO
stm8s105k.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
stm8s105k.menu.log.debug=DEBUG
stm8s105k.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
stm8s105k.menu.log.trace=TRACE
stm8s105k.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

# meaningless variables just to keep the makefile happy
stm8s105k.upload.speed=1

########################## STM8S105/005C  ####################################
stm8s105c.name=S105C/S005C

stm8s105c.upload.tool=stm8flash
stm8s105c.upload.protocol=stlink
stm8s105c.upload.mcu=stm8s105?6
stm8s105c.upload.maximum_size=32768
stm8s105c.upload.maximum_data_size=2048

stm8s105c.build.stdlibpre=STM8S
stm8s105c.build.f_cpu=16000000L
stm8s105c.build.board=STM8S_DISCOVERY
stm8s105c.build.core=sduino
stm8s105c.build.variant=stm8s105c

stm8s105c.menu.subboard.S105disco=S105C6(Discovery)
stm8s105c.menu.subboard.S105disco.build.variant=stm8s105c_disco
stm8s105c.menu.subboard.S105disco.build.series=-DSTM8S105C6 -DSTM8S
stm8s105c.menu.subboard.S105disco.build.mcu=STM8S105
stm8s105c.menu.subboard.S105disco.upload.mcu=stm8s105?6

stm8s105c.menu.subboard.S105=S105C6(generic)
stm8s105c.menu.subboard.S105.build.series=-DSTM8S105C6 -DSTM8S
stm8s105c.menu.subboard.S105.build.mcu=STM8S105
stm8s105c.menu.subboard.S105.upload.mcu=stm8s105?6

stm8s105c.menu.subboard.S105C4=S105C4(generic)
stm8s105c.menu.subboard.S105C4.build.series=-DSTM8S105C4 -DSTM8S
stm8s105c.menu.subboard.S105C4.build.mcu=STM8S105
stm8s105c.menu.subboard.S105C4.build.variant=stm8s105c
stm8s105c.menu.subboard.S105C4.upload.mcu=stm8s105?4
stm8s105c.menu.subboard.S105C4.upload.maximum_size=16384

stm8s105c.menu.subboard.S005=S005C6(generic)
stm8s105c.menu.subboard.S005.build.series=-DSTM8S005C6 -DSTM8S
stm8s105c.menu.subboard.S005.build.mcu=STM8S005
stm8s105c.menu.subboard.S005.upload.mcu=stm8s005?6

stm8s105c.menu.clock_source.hsi=HSI(16M)
stm8s105c.menu.clock_source.hsi.build.osc=-DHSI=16
stm8s105c.menu.clock_source.hse16=HSE(16M)
stm8s105c.menu.clock_source.hse16.build.osc=-DHSE=16 -DHSE_VALUE=((uint32_t)16000000)
stm8s105c.menu.clock_source.hse8=HSE(8M)
stm8s105c.menu.clock_source.hse8.build.osc=-DHSE=8 -DHSE_VALUE=((uint32_t)8000000)

stm8s105c.menu.cpu_speed.s16=16M
stm8s105c.menu.cpu_speed.s16.build.f_cpu=16000000L {build.osc}
stm8s105c.menu.cpu_speed.s08=8M
stm8s105c.menu.cpu_speed.s08.build.f_cpu=8000000L {build.osc}
stm8s105c.menu.cpu_speed.s04=4M
stm8s105c.menu.cpu_speed.s04.build.f_cpu=4000000L {build.osc}
stm8s105c.menu.cpu_speed.s02=2M
stm8s105c.menu.cpu_speed.s02.build.f_cpu=2000000L {build.osc}
stm8s105c.menu.cpu_speed.s01=1M
stm8s105c.menu.cpu_speed.s01.build.f_cpu=1000000L {build.osc}
stm8s105c.menu.cpu_speed.lsi=LSI_128K
stm8s105c.menu.cpu_speed.lsi.build.f_cpu=128000L -DLSI=128

stm8s105c.menu.jtag_swd.default=General_IO
stm8s105c.menu.jtag_swd.default.build.extra_flags={build.series}
stm8s105c.menu.jtag_swd.swim=Swim
stm8s105c.menu.jtag_swd.swim.build.extra_flags={build.series} -DENABLE_SWIM

stm8s105c.menu.log.default=Release
stm8s105c.menu.log.fatal=FATAL
stm8s105c.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_FULL_ASSERT
stm8s105c.menu.log.error=ERROR
stm8s105c.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_FULL_ASSERT
stm8s105c.menu.log.warning=WARNING
stm8s105c.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_FULL_ASSERT
stm8s105c.menu.log.info=INFO
stm8s105c.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_FULL_ASSERT
stm8s105c.menu.log.debug=DEBUG
stm8s105c.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_FULL_ASSERT
stm8s105c.menu.log.trace=TRACE
stm8s105c.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_FULL_ASSERT

# meaningless variables just to keep the makefile happy
stm8s105c.upload.speed=1

########################## STM8L151/2C  ####################################
stm8l15xc.name=L152C/L151C

stm8l15xc.upload.tool=stm8flash
stm8l15xc.upload.protocol=stlinkv2
stm8l15xc.upload.mcu=stm8l152?8
stm8l15xc.upload.maximum_size=32768
stm8l15xc.upload.maximum_data_size=2048

stm8l15xc.build.stdlibpre=STM8L
stm8l15xc.build.series=-DSTM8L152C -DSTM8L
stm8l15xc.build.mcu=STM8L15X_MD
stm8l15xc.build.f_cpu=16000000L
stm8l15xc.build.board=L152
stm8l15xc.build.core=sduino
stm8l15xc.build.variant=stm8l152c

stm8l15xc.menu.subboard.L152C8=L152C8
stm8l15xc.menu.subboard.L152C8.build.series=-DSTM8L152C -DSTM8L
stm8l15xc.menu.subboard.L152C8.build.mcu=STM8L15X_HD
stm8l15xc.menu.subboard.L152C8.upload.mcu=stm8l152?8
stm8l15xc.menu.subboard.L152C8.upload.maximum_size=65536
stm8l15xc.menu.subboard.L152C8.upload.maximum_data_size=4096


stm8l15xc.menu.subboard.L152C6=L152C6 (UDA LED:PA7)
stm8l15xc.menu.subboard.L152C6.build.series=-DSTM8L152C -DSTM8L
stm8l15xc.menu.subboard.L152C6.build.mcu=STM8L15X_MD
stm8l15xc.menu.subboard.L152C6.build.variant=l152c6t6_uda
stm8l15xc.menu.subboard.L152C6.build.board=L152C6_UDA
stm8l15xc.menu.subboard.L152C6.upload.mcu=stm8l152?6
stm8l15xc.menu.subboard.L152C6.upload.maximum_size=32768

stm8l15xc.menu.subboard.L152C4=L152C4
stm8l15xc.menu.subboard.L152C4.build.series=-DSTM8L152C -DSTM8L
stm8l15xc.menu.subboard.L152C4.build.mcu=STM8L15X_MD
stm8l15xc.menu.subboard.L152C4.upload.mcu=stm8l152?4
stm8l15xc.menu.subboard.L152C4.upload.maximum_size=16384

stm8l15xc.menu.subboard.L151C3=L151C3
stm8l15xc.menu.subboard.L151C3.build.series=-DSTM8L151C -DSTM8L
stm8l15xc.menu.subboard.L151C3.build.mcu=STM8L15X_LD
stm8l15xc.menu.subboard.L151C3.upload.mcu=stm8l151?3
stm8l15xc.menu.subboard.L151C3.upload.maximum_size=8192
stm8l15xc.menu.subboard.L151C3.upload.maximum_data_size=2048

stm8l15xc.menu.clock_source.hsi=HSI(16M)
stm8l15xc.menu.clock_source.hsi.build.osc=-DHSI=16
stm8l15xc.menu.clock_source.hse16=HSE(16M)
stm8l15xc.menu.clock_source.hse16.build.osc=-DHSE=16 -DHSE_VALUE=((uint32_t)16000000)
stm8l15xc.menu.clock_source.hse8=HSE(8M)
stm8l15xc.menu.clock_source.hse8.build.osc=-DHSE=8 -DHSE_VALUE=((uint32_t)8000000)

